Revit 2024 API
DirectShapeTypeOptions.AllowDuplicateNames Property
 Determines whether or not duplicate DirectShapeType names are allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool AllowDuplicateNames { get; set; }
Visual Basic
Public Property AllowDuplicateNames As Boolean
	Get
	Set
Visual C++
public:
property bool AllowDuplicateNames {
	bool get ();
	void set (bool value);
}
See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace